LEXICON: dict[str, str | tuple[str, str]] = {
    'start': '''👋 Добро пожаловать в Элдик Банк!
📍 Пожалуйста, выберите язык обслуживания:

1️⃣ — Кыргыз тили
2️⃣ — Русский язык''',

    'menu': '''📋 Пожалуйста, выберите услугу:

🏢 1 — Адреса и график работы отделений и банкоматов
💳 2 — Кредиты
💸 3 — Денежные переводы
🧾 4 — Платежные карты
🏦 5 — Депозиты
🕌 6 — Исламское окно
📞 7 — Связь с оператором
🧍‍♂️ 8 — Встать в очередь
🔎 9 — Узнать очередь в филиале''',

    '1': (
        '🏢 Здесь вы найдете адреса и график работы отделений и банкоматов.\n'
        '🔙 Нажмите 0 для возврата в главное меню.',
        'https://www.rsk.kg/ru/points?for_who=individual'
    ),
    '2': (
        '💳 Кредитные предложения для физических лиц.\n'
        '🔙 Нажмите 0 для возврата в главное меню.',
        'https://www.rsk.kg/ru/credits?for_who=individual'
    ),
    '3': (
        '💸 Информация о денежных переводах для физических лиц.\n'
        '🔙 Нажмите 0 для возврата в главное меню.',
        'https://www.rsk.kg/ru/transfers?for_who=individual'
    ),
    '4': (
        '🧾 Описание доступных платежных карт.\n'
        '🔙 Нажмите 0 для возврата в главное меню.',
        'https://www.rsk.kg/ru/payment-cards?for_who=individual'
    ),
    '5': (
        '🏦 Информация о депозитных предложениях.\n'
        '🔙 Нажмите 0 для возврата в главное меню.',
        'https://www.rsk.kg/ru/depozits?for_who=individual'
    ),
    '6': (
        '🕌 Исламские программы кредитования в соответствии с нормами шариата.\n'
        '🔙 Нажмите 0 для возврата в главное меню.',
        'https://www.rsk.kg/ru/page/islam-kreditovanie?for_who=individual'
    ),
    '7': (
        '📞 Свяжитесь с оператором для получения консультации.\n'
        '🔙 Нажмите 0 для возврата в главное меню.',
        ''
    ),
    '8': (
        '🧍‍♂️ Встать в очередь для получения услуги.\n'
        'Отправьте номер офиса и ваш номер телефона.\n'
        'Пример: 3 996501234567\n'
        '🔙 Для возврата в меню нажмите 0.',
        ''
    ),
    '9': (
        '🔎 Узнать текущую очередь в выбранном филиале.\n'
        'Отправьте номер офиса.\n'
        'Пример: 3\n'
        '🔙 Для возврата в меню нажмите 0.',
        ''
    ),
}


LEXICON_KG: dict[str, str | tuple[str, str]] = {
    'start': '''👋 Элдик Банкка кош келиңиз!
📍 Тейлөө тилин тандаңыз:

1️⃣ — Кыргыз тили
2️⃣ — Русский язык''',

    'menu': '''📋 Кызмат түрүн тандаңыз:

🏢 1 — Бөлүмдөрдүн жана банкоматтардын даректери жана иш графиги
💳 2 — Кредиттер
💸 3 — Акча которуулар
🧾 4 — Төлөм карталары
🏦 5 — Депозиттер
🕌 6 — Исламдык терезе
📞 7 — Оператор менен байланышуу
🧍‍♂️ 8 — Кезекке туруу
🔎 9 — Филиал боюнча кезекти көрүү''',

    '1': (
        '🏢 Бул жерден бөлүмдөрдүн жана банкоматтардын даректери жана иш графиги тууралуу маалымат таба аласыз.\n'
        '🔙 Башкы менюга кайтуу үчүн 0 баскычын басыңыз.',
        'https://www.rsk.kg/ru/points?for_who=individual'
    ),
    '2': (
        '💳 Физикалык жактар үчүн кредиттик сунуштар.\n'
        '🔙 Башкы менюга кайтуу үчүн 0 баскычын басыңыз.',
        'https://www.rsk.kg/ru/credits?for_who=individual'
    ),
    '3': (
        '💸 Акча которуулар боюнча маалымат.\n'
        '🔙 Башкы менюга кайтуу үчүн 0 баскычын басыңыз.',
        'https://www.rsk.kg/ru/transfers?for_who=individual'
    ),
    '4': (
        '🧾 Жеткиликтүү төлөм карталары тууралуу маалымат.\n'
        '🔙 Башкы менюга кайтуу үчүн 0 баскычын басыңыз.',
        'https://www.rsk.kg/ru/payment-cards?for_who=individual'
    ),
    '5': (
        '🏦 Депозиттик сунуштар тууралуу маалымат.\n'
        '🔙 Башкы менюга кайтуу үчүн 0 баскычын басыңыз.',
        'https://www.rsk.kg/ru/depozits?for_who=individual'
    ),
    '6': (
        '🕌 Шариаттын эрежелерине ылайык исламдык насыялоо программалары.\n'
        '🔙 Башкы менюга кайтуу үчүн 0 баскычын басыңыз.',
        'https://www.rsk.kg/ru/page/islam-kreditovanie?for_who=individual'
    ),
    '7': (
        '📞 Кошумча маалымат алуу үчүн оператор менен байланышыңыз.\n'
        '🔙 Башкы менюга кайтуу үчүн 0 баскычын басыңыз.',
        ''
    ),
    '8': (
        '🧍‍♂️ Кезекке туруу үчүн кеңсени тандап, телефон номериңизди жазыңыз.\n'
        'Мисалы: 3 996501234567\n'
        '🔙 Менюга кайтуу үчүн 0 баскычын басыңыз.',
        ''
    ),
    '9': (
        '🔎 Тандалган филиал боюнча учурдагы кезекти көрүү.\n'
        'Офистин номерин жазыңыз.\n'
        'Мисалы: 3\n'
        '🔙 Менюга кайтуу үчүн 0 баскычын басыңыз.',
        ''
    ),
}
